<a href="https://colab.research.google.com/github/joaovc800/Analise_de_dados/blob/main/dados.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#importando a biblioteca
import pandas as pd

In [32]:
#Leitura de arquivos
df1 = pd.read_excel("/content/mg.xlsx")
df2 = pd.read_excel("/content/rj.xlsx")
df3 = pd.read_excel("/content/sp.xlsx")

In [17]:
df = pd.concat([df1,df2,df3])

In [18]:
df.head()

  Vendedor  Produto       Cidades  Valor
0     Joao  Celular  Minas Gerais    535
1    Denis  Notbook  Minas Gerais    108
2   Danson  Bateria  Minas Gerais    317
3     Joeu    Telas  Minas Gerais    382
4    Kisha    Flets  Minas Gerais    561

In [19]:
df.tail()

   Vendedor     Produto         Cidades  Valor
6    Panton        Capa         Aracaju    520
7     Olaff  carregador           Natal    156
8     Simba     cameras  Rio de janeiro    314
9     Diego      Silver             Sul    522
10     Kali        Gold           Norte    156

In [22]:
df.sample(5)

   Vendedor     Produto         Cidades  Valor
10     Kali        Gold  Rio de janeiro    156
6    Panton        Capa  Rio de janeiro    520
2    Danson     Bateria    Minas Gerais    317
7     Olaff  carregador           Natal    156
0      Joao     Celular    Minas Gerais    535

In [23]:
df.dtypes

Vendedor    object
Produto     object
Cidades     object
Valor        int64
dtype: object

In [24]:
df["Valor"] = df["Valor"].astype("object")

In [25]:
df.dtypes

Vendedor    object
Produto     object
Cidades     object
Valor       object
dtype: object

In [26]:
df.head()

  Vendedor  Produto       Cidades Valor
0     Joao  Celular  Minas Gerais   535
1    Denis  Notbook  Minas Gerais   108
2   Danson  Bateria  Minas Gerais   317
3     Joeu    Telas  Minas Gerais   382
4    Kisha    Flets  Minas Gerais   561

In [28]:
df.isnull().sum()

Vendedor    0
Produto     0
Cidades     0
Valor       0
dtype: int64

In [31]:
df.sample(15)

  Vendedor  Produto       Cidades Valor
2   Danson  Bateria  Minas Gerais   317

In [33]:
df["Valor"].mean()

347.27272727272725